/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Все что не вошло в проект или старые/альтернативные версии кода

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//Первый вар-т слайдера начало (не использую потому что много рандома)

//Действие №1

// вычисляем размер окна для того чтобы правильно применить счетчик смещения слайдера

// function init() {
//     let widthCount;
//     let thisWidth;
//     let currentWidth = window.innerWidth;
//     //console.log(document.documentElement.clientWidth); // <-- если не сработает по ширине с window.innerWidth применить это <--
//     if (currentWidth > 992) {
//         widthCount = 3;
//     }
//     else {
//         widthCount = 2;
//     }
//     return widthCount;
// }

//Действие №2

///перелистывание слайдера начало 

// const nav = document.querySelector('.my-nav');

// let count = 0;
// document.querySelector('.arrow-left').addEventListener('click', function () {
//     count++;
//     if (count >= skills.length - init()) {
//         count = 0;
//     }
//     rollSlider();
// })

// document.querySelector('.arrow-right').addEventListener('click', function () {
//     count--;
//     if (count < 0) {
//         count = skills.length - 1 - init();
//     }
//     rollSlider();
// })

// function rollSlider() {
//     countNumber = 20; // рандомное число не знаю как взять другое
//     nav.style.transform = 'translate(-' + count * countNumber + '%)';
//     //nav.style.left = '-' + count * init()
// }

///перелистывание слайдера конец

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// функция открытия информации по клику старт (альтернативная версия)

// for (item of skills) {
//     this.item.onclick = function () {

// рабочий вариант через классы нужного элемента

// let sclassEnd = this.classList[1];
// if (this.classList.contains(sclassEnd)) {
//     document.querySelector('.article-' + sclassEnd).classList.add('active');
// }

//     }
// }
// функция открытия информации по клику конец